module.exports = {
  mock: [
    '别玩游戏了，别人都超过你了！',
    '❤️ 让大家在正确的路上携手越走越远吧！',
    '瞄准排行榜的第一名！http://123.56.222.177/',
    '今天你打卡了吗！',
    '你已经多少次当天没打卡啦！',
    '冲啊！！！！！！！！！！！！！！！！！',
    '没有对比就没有伤害。。来，面对现实吧：http://123.56.222.177/',
    '擦干眼泪，继续加油！！！冲冲冲~~~',
    '今天和大佬交流了下刷题，想问问大佬有没有诀窍，他就回了一句话：“就刷呀，刷呀。量变引起质变。”加油吧，xdm！',
    '加油吧，xdm！',
    '不掉队！',
    '今天没有头哥的鸡汤',
    ':exclamation: 昨天请假的，记得补上昨天的题！不要遗留，遗留容易放弃！！！！',
    `非宁静无以致远 💪💪💪
    我们已经一起坚持这么多天啦 ✊
    继续加油，顶峰相见。🌝`,
    '继续加油，顶峰相见。🌝',
    '今日打卡继续，大家加油！跑起来，顶峰相见！',
    '好的开始，大家一起跑起来，让我们顶峰相见。',
    `又是你的面孔
带给我是笑容
在我哭泣的时候`,
    `又是你的问候
带给我是感动
在我孤寂的时候`,
    `虽然没有天生一样的
但在地球上我们是一样的
尽管痛的苦的没说的
但哪有一路走来都是顺风的`,
    `因为我们没有什么不同
天黑时我们仰望同一片星空
没有追求和付出哪来的成功`,
    `谁说我们一定要走别人的路
谁说辉煌背后没有痛苦
只要为了梦想不服输
再苦也不停止脚步`,
    `每一天 每一年
都可以是新的起跑线
也可以是终点
看你怎么选
望着无边无际遥远的地平线
哪里会是你的极限`,
    `谁说我们一定要走别人的路(谁说要走别人的路)
谁说辉煌背后没有痛苦(谁说辉煌没有痛苦)
只要为了梦想不服输(为了梦想)
再苦也不停止脚步(也不服输)`,

  ],
  labelsName: ['小石头']
}